Shengwendi-analysis.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-08-21 一 15:03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>对佛教中“声闻地”理念的批判分析与解读</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />

<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">对佛教中“声闻地”理念的批判分析与解读</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org73d8bbf">1. 修习“声闻地”</a>
<ul>
<li><a href="#orgb48e7a5">1.1. 綱要</a></li>
<li><a href="#org6493cc1">1.2. 對 “苦” 的理解與觀想</a></li>
<li><a href="#org57f22b9">1.3. 對“集”、“滅”、“道”的理解與修行</a></li>
<li><a href="#org217a48e">1.4. 對四聖諦的總結</a></li>
</ul>
</li>
<li><a href="#org32095d8">2. 声闻地的其他问题</a></li>
<li><a href="#orgc5f1632">3. 對四諦的批判与思考</a></li>
</ul>
</div>
</div>
<p>
近日将毕业，无事，故理三年来所观群书，有《存在与时间》《通鉴》《瑜伽师地论》未读完。此处剖十七地论，单拎“声闻地”之修行与哲理解析之。
</p>
<div id="outline-container-org73d8bbf" class="outline-2">
<h2 id="org73d8bbf"><span class="section-number-2">1.</span> 修习“声闻地”</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb48e7a5" class="outline-3">
<h3 id="orgb48e7a5"><span class="section-number-3">1.1.</span> 綱要</h3>
<div class="outline-text-3" id="text-1-1">
<p>
当以“四聖諦”（苦、集、滅、道）爲綱，以得“阿羅漢果”爲目標。欲修聲聞，當以“行”爲極重，以下爲法則：
</p>

<ol class="org-ol">
<li>理解“苦”：觀察事物之 <code>無常</code> ， 所受皆 <code>苦</code> ， 理解 <code>空</code> ， 了解“無我” 。</li>
<li>理解“集”： 因 集 起 緣</li>
<li>理解“滅”： 滅 靜 妙 離</li>
<li>理解“道”： 道 如 行 出</li>
</ol>
</div>
</div>
<div id="outline-container-org6493cc1" class="outline-3">
<h3 id="org6493cc1"><span class="section-number-3">1.2.</span> 對 “苦” 的理解與觀想</h3>
<div class="outline-text-3" id="text-1-2">
<p>
當理解：
</p>

<ol class="org-ol">
<li>一切有情世間皆是“無常”。此處的無常是指事物會發生變化，不存在永恆。即事物會變異、滅壞、別離等等。</li>
<li>一切器世間皆是無常。地球有一天也會毀滅。注意：此處的無常不是沒有規律的意思，而是不會永恆不變的意思。</li>
<li>由有情無常，當知有生老病死、愛別離、怨憎會、求不得等相；</li>
<li>由器物無常，當知有成壞住空等相；</li>
<li>由因緣交會，當知人的行爲有“不自在”相，即人在江湖，身不由己。</li>
</ol>

<p>
上述1，2，3，4可總結爲“諸行無常”（不如稱爲“易”）。
</p>

<p>
藉助這種變化，可知人之所受，皆是眼、耳等諸色根以及內心思緒等無色根所產生的結果，而由於其無常，所以“人之 *所受皆苦*，也皆樂。”
</p>

<p>
由於人的行爲的不自在相，當知其行爲大多數時候並不是“真我”的想法，而是由心念隨波逐流的“雜念”，或由於社會與外界壓力（即因緣）而導致的不得不做，因此，當領悟 <b>逐行無我</b> 。
</p>

<p>
總結一下，世間萬物都有4種特點中的至少一種，即：
</p>
<ol class="org-ol">
<li>無常：器世</li>
<li>苦：有情世間</li>
<li>空：無所得</li>
<li>無我：不自在</li>
</ol>

<p>
爲斷滅此苦，當了解與觀察“苦”的產生過程，即苦的因緣，此爲“集”。下文解之。
</p>
</div>
</div>
<div id="outline-container-org57f22b9" class="outline-3">
<h3 id="org57f22b9"><span class="section-number-3">1.3.</span> 對“集”、“滅”、“道”的理解與修行</h3>
<div class="outline-text-3" id="text-1-3">
<p>
知苦後，即可以四相觀苦之來由，即苦何所因，何所集，何所起，何所緣：
</p>
<ol class="org-ol">
<li>以愛而因。（？存疑）</li>
<li>因集而集。（？） 了一解：耽於苦，一葉障目，思緒專注之，故名之爲集</li>
<li>因接續而起。了一解：苦可接續不斷，耽之，爲苦。</li>
<li>以種子攝受爲緣。了一解：種子有二解：1. 人之生理特性，如飢渴困；2.習慣。</li>
</ol>

<p>
修習聲聞，當觀察內心之苦道來由，直到無師自通。
</p>

<p>
認同世界之無常、苦、空、無我之後，可謂知苦。觀察理解熟練苦以愛爲因、以種子攝受爲緣、因集而集、因接續而起後，可謂知集。由此可觀苦之本諦爲滅：
</p>

<ol class="org-ol">
<li>苦非實體，因此
<ol class="org-ol">
<li>永遠熄滅，是爲滅相</li>
<li>永遠寂靜，是爲靜相</li>
</ol></li>
<li>這種靜態超然與世界之上，故爲”第一義“，是爲妙相</li>
<li>這種靜態是永恆不變的，不依附與世界，曰出離，是爲離相。</li>
</ol>

<p>
至此，當解苦因其靜理而現滅、靜兩相，永出離不動，是第一妙義。
</p>

<p>
（道諦待補充。）
</p>
</div>
</div>
<div id="outline-container-org217a48e" class="outline-3">
<h3 id="org217a48e"><span class="section-number-3">1.4.</span> 對四聖諦的總結</h3>
<div class="outline-text-3" id="text-1-4">
<p>
苦諦，在於察覺並認同苦，由此從無到有，確立分析對象爲”苦“。
</p>

<p>
集諦，對苦的因緣變化進行分析，由此得到苦是怎麼來的，怎麼沒的，等等。
</p>

<p>
滅諦，對苦進行現象學分析，給出了苦的現象分析，即滅字，由此說明其廣泛存在道特性。
</p>

<p>
道諦，XXXX
</p>
</div>
</div>
</div>
<div id="outline-container-org32095d8" class="outline-2">
<h2 id="org32095d8"><span class="section-number-2">2.</span> 声闻地的其他问题</h2>
<div class="outline-text-2" id="text-2">
<p>
修習聲聞，當除”我慢“。所謂”我慢“者，我知而尓不知，唯獨我知，是爲我慢。所謂自大自傲者也。
</p>

<p>
若有我慢，則心向往涅磐，故”四聖諦”反成執念，此執念則生愛，僥倖得之，則有樂受，若不察覺，則心無法證入“滅苦”之道，由此苦集滅道反倒未修成，由此共虧一潰。故《金剛經》談“誤作是念”，即關不能以果爲慢也。
</p>
</div>
</div>

<div id="outline-container-orgc5f1632" class="outline-2">
<h2 id="orgc5f1632"><span class="section-number-2">3.</span> 對四諦的批判与思考</h2>
<div class="outline-text-2" id="text-3">
<p>
待補充。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Thu May 18 21:04:49 2023</p>
<p class="author">Author: Zi Liang</p>
<p class="date">Created: 2023-08-21 一 15:03</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
